
Функция Сохранить() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Серверы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Серверы КАК Серверы
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Клиенты.Ссылка
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура");
	Таб = Запрос.Выполнить().Выгрузить();
	МассивСправочниов = Новый Массив;
	Для каждого стр из Таб Цикл
		МассивСправочниов.Добавить(стр.Ссылка.ПолучитьОбъект());
	КонецЦикла;	
	
	Данные = Новый структура();
	Данные.Вставить("СтильОформления",Константы.СтильОформления.Получить());	
	Данные.Вставить("Справочники",МассивСправочниов);	
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(,Символы.Таб);
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON, Данные, НазначениеТипаXML.Явное);
	Текст =  ЗаписьJSON.Закрыть();
	
	Возврат Текст
	
КонецФункции

Процедура Восстановить(Текст) Экспорт
	
	УдалитьДанныеСправочников();
	
	ЧтениеJson = Новый ЧтениеJson;
	ЧтениеJson.УстановитьСтроку(Текст);
	Данные = СериализаторXDTO.ПрочитатьJSON(ЧтениеJson);
	
	Константы.СтильОформления.Установить(Данные.СтильОформления);
	
	Для каждого стр из Данные.Справочники Цикл
		стр.Записать();
	КонецЦикла;	
	ЧтениеJson.Закрыть();
	
КонецПроцедуры

Процедура УдалитьДанныеСправочников()
	
	Выборка = Справочники.Клиенты.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.Серверы.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла; 
	
	Выборка = Справочники.Номенклатура.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();	
		СпрОбъект.Удалить(); 
	КонецЦикла;
	
КонецПроцедуры