
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Пароль = Константы.ПарольДляВхода.Получить();
	Если НЕ Пароль = "" Тогда
		ВходПоПаролю = Истина;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВходПоПаролю Тогда 
		ОткрытьФорму("ОбщаяФорма.ВходПоПаролю");
	КонецЕсли;	
	Элементы.Группа1.ВертикальноеПоложениеПодчиненных = ВертикальноеПоложениеЭлемента.Низ;
	Элементы.Группа1.РастягиватьПоВертикали = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура БД(Команда)
	ОткрытьФорму("Справочник.БД.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Видеорегистраторы(Команда)
	ОткрытьФорму("Справочник.Видеорегистраторы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Домены(Команда)
	ОткрытьФорму("Справочник.Домены.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Кассы(Команда)
	ОткрытьФорму("Справочник.Кассы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Клиенты(Команда)
	ОткрытьФорму("Справочник.Клиенты.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Номенклатура(Команда)
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОперационныеСистемы(Команда)
	ОткрытьФорму("Справочник.ОперационныеСистемы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Принтеры(Команда)
	ОткрытьФорму("Справочник.Принтеры.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Серверы(Команда)
	ОткрытьФорму("Справочник.Серверы.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СУБД(Команда)
	ОткрытьФорму("Справочник.СУБД.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Выход(Команда)
	ЗавершитьРаботуСистемы(Ложь,Ложь);
КонецПроцедуры

&НаКлиенте
Процедура Настройки(Команда)
	ОткрытьФорму("ОбщаяФорма.Настройки");
КонецПроцедуры

&НаКлиенте
Процедура ПользовательНажатие(Элемент, СтандартнаяОбработка)
КонецПроцедуры

&НаКлиенте
Процедура Заметки(Команда)
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Slack(Команда)
	ОткрытьФорму("Обработка.ПанельВзаимодействия.Форма.Slack");
КонецПроцедуры

&НаКлиенте
Процедура Файлы(Команда)
	ОткрытьФорму("Справочник.Файлы.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура УчетныеДанные(Команда)
	ОткрытьФорму("Справочник.УчетныеДанныеСервисов.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Сервисы(Команда)
	ОткрытьФорму("Справочник.Сервисы.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СетевоеОборудование(Команда)
	ОткрытьФорму("Справочник.СетевоеОборудование.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Устройства(Команда)
	ОткрытьФорму("Справочник.Устройства.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура СерверыVPN(Команда)
	ОткрытьФорму("Справочник.СерверыVPN.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура Сети(Команда)
	ОткрытьФорму("Справочник.Сети.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура УстройстваСУдаленнымУправлением(Команда)
	ОткрытьФорму("Справочник.УстройстваСУдаленнымУправлением.ФормаСписка");
КонецПроцедуры
